app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'XXXADRIANXXX'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $userModel->where('username', $username)->first();